#Напишите программу, которая добавляет ‘ing’ к слову ‘stroka’

new_str = 'ing'

another_srt = 'stroka'

print(another_srt + new_str)