#Напишите программу которая удаляет пробел в начале, в конце строки

my_info = "  My name is Daniil  "

cleaned_info = my_info.strip('  ')

print (cleaned_info)